# Тема: Введение в С++

**Цель работы:** Создание консольной программы на языке С++ с целью изучения общей структуры консольной программы,
знакомства с основами системы ввода-вывода и повторения изученного ранее материала по работе со строками вида char*
в С++.

**Общие требования к выполнению работы:**

1. Изучить особенности создания консольных программ на языке С++ (структура, встроенные типы данных, операторы 
   ввода-вывода, библиотеки ввода-вывода и работы со строками вида char*).
2. Создать проект консольной программы.
3. Реализовать программу, которая выполняет консольный ввод-вывод согласно заданию.
4. В программе нельзя использовать старую систему ввода-вывода данных языка С (printf() / fprintf() и т.п.). Ввод и 
   вывод информации вести только с использованием потоков ввода-вывода и соответствующих операторов.
5. Для упрощения работы со строчными данными считать, что строка не может быть более 80 символов.
6. Предусмотреть в программе реакцию на ошибочные действия пользователя при вводе данных (например, организация повтора
   ввода).

**Контрольные вопросы:**

1. Структура консольной программы в С++.
2. Библиотека ввода-вывода в С++.
3. Потоки для консольного ввода-вывода в С++.
4. Операторы для консольного ввода-вывода в С++.
5. Работа со строками вида char* в С++.

**Задание:**

Написать программу, имитирующую простой диалог с компьютером (например, запрос имени пользователя и 3 вопроса к
пользователю с использованием этого имени в обращении).

**Дополнительное задание:**

Добавить переменную для фамилии. Фамилия может состоять из букв и одного '-'.
